{"https://www.theguardian.com/us-news/2024/nov/07/florida-amendment-2-fish-trophy-hunting": "Critics say amendment 2 is intentionally open to applying chicanery and outdated hunting practices Black bears in Florida could soon again be in the crosshairs of trophy hunters after a controversial wildlife ballot measure was approved by voters environmental advocates say. The fear stems from amendment 2 which enshrines into the state constitution legal protections for citizens right to hunt and fish. The law critics say was written deliberately vaguely in order to present it as a conservation measure instead of a vehicle they claim will speed the rolling back of environmental protections and open a pathway to future legislation permitting inhumane measures such as steeljawed traps and hunting with dogs. Bear hunting has been banned in Florida since 1994 except for a limited single season in 2015 and while the amendment does not specifically reintroduce it activists say it is a significant step on the way. Earlier this year state legislators passed a law allowing the shooting and killing of black bears in selfdefense with opponents at the time pointing out it could be abused especially in rural areas by landowners simply wanting to eliminate what they saw as nuisance animals. The runup to Tuesdays election saw a cascade of TV commercials and other media attention in Florida dedicated to more prominent ballot measures such as a protection of abortion rights and the legalization of recreational marijuana. Both failed. The approval of amendment 2 is disappointing as it suggests that many voters may not have been fully informed about the implications of this measure said Kate MacFall Florida state director for the Humane Society of the US. Unfortunately our states constitution now includes language that could lead to attempts to legalize outdated cruel and harmful practices such as the trophy hunting of black bears trapping snaring and baiting activities that most Floridians neither participate in nor support. She said the amendment that establishes hunting as the preferred means of wildlife management in Florida ignored the availability of proven nonlethal conflictprevention measures. Efforts by the Florida fish and wildlife conservation commission FWC to pass essential wildlife protections affecting hunting and fishing could also be compromised she added. Scientists and conservationists warned ahead of election day that the language of the amendment specifically a vague reference to traditional methods as the preferred form of legalized hunting could supersede sciencebased wildlife management. That language is open to applying chicanery David Guest a retired Earthjustice lawyer based in Florida told the Guardian. Does that mean that you can use explosives in the destructive practice called blast fishing I mean what in the world is this There is no legal or other definition of traditional methods in the subsequent language of the amendment Guest said leaving its interpretation wide open. Opponents say that vagueness could enable worstcase possibilities such as the use of steeljaw leghold traps which are considered cruel and illegal in more than 100 countries using hounds to hunt bears and other game which is banned or restricted in several states and more relaxed killing limits. Meanwhile a Florida Bar analysis suggested that organized hunts are likely to become more common. The amendment received 67 support far surpassing the 60 needed. With its passage Florida became the 24th state and last in the southeast to add hunting and fishing as a constitutional right. Conservativeleaning groups such as the National Rifle Association and Congressional Sportsmens Foundation are behind a number of similar sportsmens bills of rights measures across the country. They view hunting as a cultural tradition and legislation they sponsor is intended to counter proposals to limit hunting and fishing. Despite this discouraging result the Humane Society of the US will continue to fight to protect Floridas wildlife from these cruel practices at all levels MacFall said.", "https://www.breitbart.com/entertainment/2024/10/26/leonardo-dicaprio-jet-setting-climate-doomer-endorses-kamala-harris-to-help-save-the-planet/": "Actor Leonardo DiCaprio has endorsed Vice President Kamala Harris for president pitching her as the candidate to help save the planet from climate doom despite the Hollywood stars own frequent flights and yacht excursions. In a video posted to Instagram Friday DiCaprio began by discussing the destruction of hurricanes Helene and Milton calling the storms unnatural disasters that were caused by climate change. A post shared by Leonardo DiCaprio leonardodicaprio The Body of Lies actor then tore into former president Donald Trump alleging he continues to deny the science of climate doomsaying. He withdrew the United States from the Paris Climate Accords and rolled back critical environmental protections DiCaprio said of Trumps first administration. Now hes promised the oil and gas industry thatll get rid of any regulation they want in exchange for a billiondollar donation. The final claim is based on an anonymouslysourced Washington Post article from May Trump has only received about 14 million from oil and gas industry donors this cycle. Climate change is killing the earth and ruining our economy DiCaprio continued. We need a bold step forward to save our economy our planet and ourselves. Thats why Im voting for Kamala Harris. Shockingly the actor touted Harriss tiebreaking vote on the Inflation Reduction Act which he describes as the most significant climate action in U.S. history. The law has haunted Harriss campaign as it did nothing to stop soaring prices and President Joe Biden has even admitted it was deceptively named. DiCaprio directs his fans to a DNC website I Will Vote .com before inviting them to join me in voting for Kamala Harris on November 5th. The Dont Look Up star has long been known for epic hypocrisy as a climate doomer. A few recent examples include Revelations that he took a 150000 payment to ride a private jet for an appearance at a party Warning the world literally only has nine years left right after taking a leisure trip on a yacht Staying silent on fires in Brazils Amazon rainforest even though they are much larger than the ones that occurred during conservative Jair Bolsonaros administration prompting much public wailing and gnashing of teeth from DiCaprio Please let us know if youre having issues with commenting. Copyright 2024 Breitbart"}